var GP = new Array('安徽','北京','重庆','福建','广西','贵州','广东','甘肃','海南','湖北','黑龙江','河南','河北','湖南','江苏','吉林','江西','辽宁','内蒙古','宁夏','澳门','青海','四川','陕西','上海','山东','山西','台湾','天津','西藏','香港','新疆','云南','浙江');
var GP_EN = new Array('A 安徽','B 北京','C 重庆','F 福建','G 广西','G 贵州','G 广东','G 甘肃','H 海南','H 湖北','H 黑龙江','H 河南','H 河北','H 湖南','J 江苏','J 吉林','J 江西','L 辽宁','N 内蒙古','N 宁夏','O 澳门','Q 青海','S 四川','S 陕西','S 上海','S 山东','S 山西','T 台湾','T 天津','X 西藏','X 香港','X 新疆','Y 云南','Z 浙江');
var GC1 =new Array();
GC1['安徽']=new Array('阜阳','合肥','芜湖','蚌埠','淮南','马鞍山','淮北','铜陵','安庆','黄山','滁州','宿州','巢湖','六安','亳州','池州','宣城');
GC1['北京']=new Array('北京');
GC1['重庆']=new Array('重庆');
GC1['福建']=new Array('福州','厦门','三明','莆田','泉州','漳州','南平','龙岩','宁德');
GC1['广西']=new Array('百色','南宁','柳州','桂林','梧州','北海','防城港','钦州','贵港','玉林','贺州','河池','来宾','崇左');
GC1['贵州']=new Array('黔东南苗族侗族自治州','贵阳','六盘水','遵义','安顺','铜仁','毕节','黔西南布依族苗族自治州','黔南布依族苗族自治州');
GC1['广东']=new Array('云浮','广州','深圳','珠海','汕头','韶关','河源','梅州','惠州','汕尾','东莞','中山','江门','佛山','阳江','湛江','茂名','肇庆','清远','潮州','揭阳');
GC1['甘肃']=new Array('甘南藏族自治州','兰州','金昌','白银','天水','嘉峪关','武威','张掖','平凉','酒泉','庆阳','定西','陇南','临夏回族自治州');
GC1['海南']=new Array('保亭黎族苗族自治县','南沙群岛','西沙群岛','中沙群岛的岛礁及其海域','海口','三亚','五指山','琼海','儋州','文昌','万宁','东方','澄迈县','定安县','屯昌县','临高县','白沙黎族自治县','昌江黎族自治县','乐东黎族自治县','陵水黎族自治县','琼中黎族苗族自治县');
GC1['湖北']=new Array('武汉','黄石','襄阳','十堰','荆州','宜昌','荆门','鄂州','孝感','黄冈','咸宁','随州','仙桃','天门','潜江','神农架林区','恩施土家族苗族自治州');
GC1['黑龙江']=new Array('哈尔滨','齐齐哈尔','鹤岗','双鸭山','鸡西','大庆','伊春','牡丹江','佳木斯','七台河','黑河','绥化','大兴安岭');
GC1['河南']=new Array('郑州','鹤壁','开封','洛阳','平顶山','焦作','新乡','安阳','濮阳','许昌','漯河','三门峡','南阳','商丘','信阳','周口','驻马店');
GC1['河北']=new Array('石家庄','唐山','秦皇岛','邯郸','邢台','保定','张家口','承德','沧州','廊坊','衡水');
GC1['湖南']=new Array('长沙','株洲','湘潭','衡阳','邵阳','岳阳','常德','张家界','益阳','郴州','永州','怀化','娄底','湘西土家族苗族自治州');
GC1['江苏']=new Array('南京','徐州','连云港','淮安','宿迁','盐城','扬州','泰州','南通','镇江','常州','无锡','苏州','昆山','江阴','常熟');
GC1['吉林']=new Array('长春','吉林','四平','辽源','通化','白山','松原','白城','延边朝鲜族自治州');
GC1['江西']=new Array('南昌','景德镇','萍乡','新余','九江','鹰潭','赣州','吉安','宜春','抚州','上饶');
GC1['辽宁']=new Array('本溪','沈阳','大连','鞍山','抚顺','丹东','锦州','葫芦岛','营口','盘锦','阜新','辽阳','铁岭','朝阳');
GC1['内蒙古']=new Array('乌兰察布','锡林郭勒盟','巴彦淖尔','阿拉善盟','兴安盟','呼和浩特','包头','乌海','赤峰','通辽','鄂尔多斯','呼伦贝尔');
GC1['宁夏']=new Array('银川','石嘴山','吴忠','中卫','固原');
GC1['澳门']=new Array('澳门');
GC1['青海']=new Array('西宁','海东','海北藏族自治州','黄南藏族自治州','海南藏族自治州','果洛藏族自治州','玉树藏族自治州','海西蒙古族藏族自治州');
GC1['四川']=new Array('成都','自贡','攀枝花','泸州','德阳','绵阳','广元','遂宁','内江','乐山','南充','宜宾','广安','达州','巴中','眉山','资阳','阿坝藏族羌族自治州','甘孜藏族自治州','凉山彝族自治州','雅安');
GC1['陕西']=new Array('西安','铜川','宝鸡','咸阳','渭南','延安','汉中','榆林','安康','商洛');
GC1['上海']=new Array('上海');
GC1['山东']=new Array('聊城','滨州','菏泽','潍坊','日照','济南','青岛','淄博','枣庄','东营','烟台','威海','济宁','泰安','莱芜','德州','临沂');
GC1['山西']=new Array('太原','大同','阳泉','长治','晋城','朔州','晋中','忻州','临汾','运城','吕梁');
GC1['台湾']=new Array('台湾');
GC1['天津']=new Array('天津');
GC1['西藏']=new Array('拉萨','那曲','昌都','山南','日喀则','阿里','林芝');
GC1['香港']=new Array('香港');
GC1['新疆']=new Array('乌鲁木齐','克拉玛依','石河子','阿拉尔','图木舒克','五家渠','吐鲁番','哈密','和田','阿克苏','克孜勒苏柯尔克孜自治州','巴音郭楞蒙古自治州','昌吉回族自治州','博尔塔拉蒙古自治州','伊犁哈萨克自治州','喀什','阿勒泰地区','塔城地区');
GC1['云南']=new Array('昆明','曲靖','玉溪','保山','昭通','普洱','临沧','丽江','文山壮族苗族自治州','红河哈尼族彝族自治州','西双版纳傣族自治州','楚雄彝族自治州','大理白族自治州','德宏傣族景颇族自治州','怒江傈傈族自治州','迪庆藏族自治州');
GC1['浙江']=new Array('宁波','温州','嘉兴','湖州','绍兴','金华','舟山','台州','丽水','杭州','衢州','义乌');
var GC2 =new Array();
GC2['安徽']=new Array();
GC2['安徽']['阜阳']=new Array('阜阳市颍东区','阜阳市颍泉区','阜阳市颍州区','阜阳市','界首市','临泉县','颍上县','阜南县','太和县');
GC2['安徽']['合肥']=new Array('合肥市包河区','合肥市庐阳区','合肥市蜀山区','合肥市瑶海区','合肥市','长丰县','肥东县','肥西县','经开区','高新区','滨湖新区','政务区','新站区','巢湖市');
GC2['安徽']['芜湖']=new Array('芜湖市镜湖区','芜湖市鸠江区','芜湖市三山区','芜湖市弋江区','芜湖市','芜湖县','南陵县','繁昌县');
GC2['安徽']['蚌埠']=new Array('蚌埠市蚌山区','蚌埠市淮上区','蚌埠市龙子湖区','蚌埠市禹会区','蚌埠市','怀远县','固镇县','五河县');
GC2['安徽']['淮南']=new Array('淮南市八公山区','淮南市大通区','淮南市潘集区','淮南市田家庵区','淮南市谢家集区','淮南市','凤台县');
GC2['安徽']['马鞍山']=new Array('马鞍山市雨山区','马鞍山市花山区','马鞍山市金家庄区','马鞍山市','当涂县');
GC2['安徽']['淮北']=new Array('淮北市杜集区','淮北市烈山区','淮北市相山区','淮北市','濉溪县');
GC2['安徽']['铜陵']=new Array('铜陵市铜官山区','铜陵市郊区','铜陵市狮子山区','铜陵市','铜陵县');
GC2['安徽']['安庆']=new Array('安庆市大观区','安庆市宜秀区','安庆市迎江区','安庆市','桐城市','宿松县','枞阳县','太湖县','怀宁县','岳西县','望江县','潜山县');
GC2['安徽']['黄山']=new Array('歙县','黄山市黄山区','黄山市徽州区','黄山市屯溪区','黄山市','休宁县','祁门县','黟县');
GC2['安徽']['滁州']=new Array('滁州市琅琊区','滁州市南谯区','滁州市','天长市','明光市','全椒县','来安县','定远县','凤阳县');
GC2['安徽']['宿州']=new Array('灵璧县','宿州市埇桥区','宿州市','萧县','泗县','砀山县');
GC2['安徽']['巢湖']=new Array('巢湖市居巢区','巢湖市','含山县','无为县','庐江县','和县');
GC2['安徽']['六安']=new Array('六安市金安区','六安市裕安区','六安市','寿县','霍山县','霍邱县','舒城县','金寨县');
GC2['安徽']['亳州']=new Array('亳州市谯城区','亳州市','利辛县','涡阳县','蒙城县');
GC2['安徽']['池州']=new Array('池州市贵池区','池州市','东至县','石台县','青阳县');
GC2['安徽']['宣城']=new Array('宣城市宣州区','宣城市','宁国市','广德县','郎溪县','泾县','旌德县','绩溪县');
GC2['北京']=new Array();
GC2['北京']['北京']=new Array('北京市朝阳区','北京市崇文区','北京市大兴区','北京市东城区','北京市房山区','北京市丰台区','北京市海淀区','北京市门头沟区','北京市平谷区','北京市石景山区','北京市顺义区','北京市通州区','北京市西城区','北京市宣武区','北京市昌平区','北京市怀柔区','北京市','密云县','延庆县');
GC2['重庆']=new Array();
GC2['重庆']['重庆']=new Array('重庆市','重庆市永川区','重庆市合川区','重庆市江津区','重庆市南川区','綦江县','潼南县','荣昌县','璧山县','大足县','梁平县','城口县','垫江县','武隆县','丰都县','奉节县','开县','云阳县','忠县','巫溪县','巫山县','石柱土家族自治县','秀山土家族苗族自治县','酉阳土家族苗族自治县','彭水苗族土家族自治县','铜梁县','重庆市巴南区','重庆市北碚区','重庆市长寿区','重庆市大渡口区','重庆市涪陵区','重庆市江北区','重庆市九龙坡区','重庆市南岸区','重庆市黔江区','重庆市沙坪坝区','重庆市双桥区','重庆市万盛区','重庆市万州区','重庆市渝北区','重庆市渝中区');
GC2['福建']=new Array();
GC2['福建']['福州']=new Array('长乐市','福州市仓山区','福州市晋安区','福州市马尾区','福州市台江区','福州市鼓楼区','福州市','福清市','闽侯县','闽清县','永泰县','连江县','罗源县','平潭县');
GC2['福建']['厦门']=new Array('厦门市海沧区','厦门市湖里区','厦门市集美区','厦门市思明区','厦门市同安区','厦门市翔安区','厦门市');
GC2['福建']['三明']=new Array('将乐县','三明市梅列区','三明市三元区','三明市','永安市','明溪县','大田县','宁化县','建宁县','沙县','尤溪县','清流县','泰宁县');
GC2['福建']['莆田']=new Array('莆田市城厢区','莆田市荔城区','莆田市秀屿区','莆田市涵江区','莆田市','仙游县');
GC2['福建']['泉州']=new Array('泉州市','泉州市丰泽区','泉州市鲤城区','泉州市洛江区','泉州市泉港区','石狮市','晋江市','南安市','惠安县','永春县','安溪县','德化县','金门县');
GC2['福建']['漳州']=new Array('漳州市龙文区','漳州市芗城区','漳州市','龙海市','平和县','南靖县','诏安县','漳浦县','华安县','东山县','长泰县','云霄县');
GC2['福建']['南平']=new Array('南平市延平区','南平市','建瓯市','邵武市','武夷山市','建阳市','松溪县','光泽县','顺昌县','浦城县','政和县');
GC2['福建']['龙岩']=new Array('龙岩市新罗区','龙岩市','漳平市','长汀县','武平县','上杭县','永定县','连城县');
GC2['福建']['宁德']=new Array('福安市','宁德市蕉城区','宁德市','福鼎市','寿宁县','霞浦县','柘荣县','屏南县','古田县','周宁县');
GC2['广西']=new Array();
GC2['广西']['百色']=new Array('百色市右江区','百色市','凌云县','平果县','西林县','乐业县','德保县','田林县','田阳县','靖西县','田东县','那坡县','隆林各族自治县');
GC2['广西']['南宁']=new Array('南宁市钦南区','南宁市江南区','南宁市良庆区','南宁市青秀区','南宁市西乡塘区','南宁市兴宁区','南宁市钦北区','南宁市长洲区','南宁市蝶山区','南宁市万秀区','南宁市玉州区','南宁市','南宁市邕宁区','武鸣县','隆安县','马山县','上林县','宾阳县','横县');
GC2['广西']['柳州']=new Array('柳州市柳南区','柳州市城中区','柳州市柳北区','柳州市鱼峰区','柳州市','柳江县','柳城县','鹿寨县','融安县','融水苗族自治县','三江侗族自治县');
GC2['广西']['桂林']=new Array('桂林市象山区','桂林市叠彩区','桂林市七星区','桂林市秀峰区','桂林市雁山区','桂林市','阳朔县','临桂县','灵川县','全州县','平乐县','兴安县','灌阳县','荔蒲县','资源县','永福县','龙胜各族自治县','恭城瑶族自治县');
GC2['广西']['梧州']=new Array('藤县','梧州市','岑溪市','苍梧县','蒙山县');
GC2['广西']['北海']=new Array('北海市海城区','北海市铁山港区','北海市银海区','北海市','合浦县');
GC2['广西']['防城港']=new Array('防城港市防城区','防城港市港口区','防城港市','东兴市','上思县');
GC2['广西']['钦州']=new Array('浦北县','钦州市','灵山县');
GC2['广西']['贵港']=new Array('贵港市港北区','贵港市港南区','贵港市覃塘区','贵港市','桂平市','平南县');
GC2['广西']['玉林']=new Array('玉林市','北流市','容县','陆川县','博白县','兴业县');
GC2['广西']['贺州']=new Array('贺州市八步区','贺州市','钟山县','昭平县','富川瑶族自治县');
GC2['广西']['河池']=new Array('河池市金城江区','河池市','宜州市','天峨县','凤山县','南丹县','东兰县','都安瑶族自治县','罗城仫佬族自治县','巴马瑶族自治县','环江毛南族自治县','大化瑶族自治县');
GC2['广西']['来宾']=new Array('来宾市兴宾区','来宾市','合山市','象州县','武宣县','忻城县','金秀瑶族自治县');
GC2['广西']['崇左']=new Array('崇左市江洲区','崇左市','凭祥市','扶绥县','大新县','天等县','宁明县','龙州县');
GC2['贵州']=new Array();
GC2['贵州']['黔东南苗族侗族自治州']=new Array('丹寨县','凯里市','施秉县','从江县','锦屏县','镇远县','麻江县','台江县','天柱县','黄平县','榕江县','剑河县','三穗县','雷山县','黎平县','岑巩县');
GC2['贵州']['贵阳']=new Array('清镇市','贵阳市南明区','贵阳市白云区','贵阳市花溪区','贵阳市乌当区','贵阳市小河区','贵阳市云岩区','贵阳市','开阳县','修文县','息烽县','金阳新区','贵阳周边','贵阳中心区');
GC2['贵州']['六盘水']=new Array('六盘水市六枝特区','六盘水市钟山区','六盘水市','水城县','盘县','六枝特区');
GC2['贵州']['遵义']=new Array('仁怀市','遵义市红花岗区','遵义市汇川区','遵义市','赤水市','遵义县','绥阳县','桐梓县','习水县','凤冈县','正安县','余庆县','湄潭县','道真仡佬族苗族自治县','务川仡佬族苗族自治县');
GC2['贵州']['安顺']=new Array('安顺市西秀区','安顺市','普定县','平坝县','镇宁布依族苗族自治县','紫云苗族布依族自治县','关岭布依族苗族自治县');
GC2['贵州']['铜仁']=new Array('铜仁地区万山特区','铜仁市','德江县','江口县','思南县','石阡县','玉屏侗族自治县','松桃苗族自治县','印江土家族苗族自治县','沿河土家族自治县','万山特区');
GC2['贵州']['毕节']=new Array('毕节市','黔西县','大方县','织金县','金沙县','赫章县','纳雍县','威宁彝族回族苗族自治县','七星关区');
GC2['贵州']['黔西南布依族苗族自治州']=new Array('兴义市','望谟县','兴仁县','普安县','册亨县','晴隆县','贞丰县','安龙县');
GC2['贵州']['黔南布依族苗族自治州']=new Array('都匀市','福泉市','贵定县','惠水县','罗甸县','瓮安县','荔波县','龙里县','平塘县','长顺县','独山县','三都水族自治县');
GC2['广东']=new Array();
GC2['广东']['云浮']=new Array('云浮市云城区','云浮市','罗定市','云安县','新兴县','郁南县');
GC2['广东']['广州']=new Array('广州市海珠区','广州市白云区','广州市番禺一区','广州市花都区','广州市黄埔区','广州市荔湾区','广州市萝岗区','广州市南沙区','广州市天河区','广州市越秀区','广州市','从化市','增城市','广州市增城二区','广州市番禺二区');
GC2['广东']['深圳']=new Array('深圳市南山区','深圳市宝安区','深圳市福田区','深圳市龙岗区','深圳市罗湖区','深圳市盐田区','深圳市','深圳市龙华新区','深圳市光明新区','深圳市坪山新区','深圳市大鹏新区','深圳市龙岗区周边','深圳市宝安区周边');
GC2['广东']['珠海']=new Array('珠海市斗门区','珠海市金湾区','珠海市香洲区','珠海市');
GC2['广东']['汕头']=new Array('汕头市潮南区','汕头市潮阳区','汕头市澄海区','汕头市濠江区','汕头市金平区','汕头市龙湖区','汕头市','南澳县');
GC2['广东']['韶关']=new Array('韶关市武江区','韶关市浈江区','韶关市','乐昌市','南雄市','仁化县','始兴县','翁源县','韶关市曲江区','新丰县','乳源瑶族自治县');
GC2['广东']['河源']=new Array('连平县','河源市源城区','河源市','和平县','龙川县','紫金县','东源县');
GC2['广东']['梅州']=new Array('梅州市梅江区','梅州市','兴宁市','梅县','蕉岭县','大埔县','丰顺县','五华县','平远县');
GC2['广东']['惠州']=new Array('惠州市惠城区','惠州市惠阳区','惠州市','惠东县','博罗县','龙门县','惠州市大亚湾区','惠州市仲恺区');
GC2['广东']['汕尾']=new Array('汕尾市城区','汕尾市','陆丰市','海丰县','陆河县');
GC2['广东']['东莞']=new Array('东莞市','莞城区','南城区','万江区','东城区','石碣镇','石龙镇','茶山镇','石排镇','企石镇','横沥镇','桥头镇','谢岗镇','东坑镇','常平镇','寮步镇','大朗镇','黄江镇','清溪镇','塘厦镇','凤岗镇','长安镇','虎门镇','厚街镇','沙田镇','道滘镇','洪梅镇','麻涌镇','中堂镇','高埗镇','樟木头镇','大岭山镇','望牛墩镇');
GC2['广东']['中山']=new Array('中山市','中山市石岐区','中山市东区','中山市西区','中山市南区','中山市五桂山区','中山市火炬开发区','中山市黄圃镇','中山市南头镇','中山市东凤镇','中山市阜沙镇','中山市小榄镇','中山市东升镇','中山市古镇镇','中山市横栏镇','中山市三角镇','中山市民众镇','中山市南朗镇','中山市港口镇','中山市大涌镇','中山市沙溪镇','中山市三乡镇','中山市板芙镇','中山市神湾镇','中山市坦洲镇');
GC2['广东']['江门']=new Array('江门市江海区','江门市蓬江区','江门市新会区','江门市','台山市','开平市','鹤山市','恩平市');
GC2['广东']['佛山']=new Array('佛山市禅城区','佛山市高明区','佛山市南海区','佛山市三水区','佛山市顺德区','佛山市','佛山市南海二区','佛山市南海三区','佛山市顺德二区','佛山市顺德三区');
GC2['广东']['阳江']=new Array('阳江市江城区','阳江市','阳春市','阳西县','阳东县');
GC2['广东']['湛江']=new Array('湛江市赤坎区','湛江市麻章区','湛江市坡头区','湛江市霞山区','湛江市','廉江市','雷州市','吴川市','遂溪县','徐闻县');
GC2['广东']['茂名']=new Array('茂名市茂港区','茂名市茂南区','茂名市','高州市','化州市','信宜市','电白县');
GC2['广东']['肇庆']=new Array('肇庆市鼎湖区','肇庆市端州区','肇庆市','高要市','四会市','广宁县','德庆县','封开县','怀集县');
GC2['广东']['清远']=new Array('清远市清城区','清远市','英德市','连州市','佛冈县','阳山县','清新县','连山壮族瑶族自治县','连南瑶族自治县');
GC2['广东']['潮州']=new Array('潮州市湘桥区','潮州市','潮安县','饶平县');
GC2['广东']['揭阳']=new Array('揭阳市榕城区','揭阳市','普宁市','揭东县','揭西县','惠来县');
GC2['甘肃']=new Array();
GC2['甘肃']['甘南藏族自治州']=new Array('合作市','临潭县','卓尼县','舟曲县','迭部县','玛曲县','碌曲县','夏河县');
GC2['甘肃']['兰州']=new Array('皋兰县','兰州市七里河区','兰州市安宁区','兰州市城关区','兰州市红古区','兰州市西固区','兰州市','永登县','榆中县');
GC2['甘肃']['金昌']=new Array('金昌市金川区','金昌市','永昌县');
GC2['甘肃']['白银']=new Array('白银市白银区','白银市平川区','白银市','靖远县','景泰县','会宁县');
GC2['甘肃']['天水']=new Array('甘谷县','天水市北道区','天水市秦城区','天水市','武山县','清水县','秦安县','张家川回族自治县');
GC2['甘肃']['嘉峪关']=new Array('嘉峪关市');
GC2['甘肃']['武威']=new Array('武威市凉州区','武威市','民勤县','古浪县','天祝藏族自治县');
GC2['甘肃']['张掖']=new Array('张掖市甘州区','张掖市','民乐县','山丹县','临泽县','高台县','肃南裕固族自治县');
GC2['甘肃']['平凉']=new Array('平凉市崆峒区','平凉市','灵台县','静宁县','崇信县','华亭县','泾川县','庄浪县');
GC2['甘肃']['酒泉']=new Array('酒泉市肃州区','酒泉市','玉门市','敦煌市','瓜州县','金塔县','阿克塞哈萨克族自治县','肃北蒙古族自治县');
GC2['甘肃']['庆阳']=new Array('庆阳市西峰区','庆阳市','庆城县','镇原县','合水县','华池县','环县','宁县','正宁县');
GC2['甘肃']['定西']=new Array('漳县','定西市安定区','定西市','岷县','渭源县','陇西县','通渭县','临洮县');
GC2['甘肃']['陇南']=new Array('陇南市','成县','礼县','康县','陇南市武都区','文县','两当县','徽县','宕昌县','西和县');
GC2['甘肃']['临夏回族自治州']=new Array('广河县','临夏市','临夏县','康乐县','永靖县','和政县','东乡族自治县','积石山保安族东乡族撒拉族自治县');
GC2['海南']=new Array();
GC2['海南']['保亭黎族苗族自治县']=new Array('保亭黎族苗族自治县');
GC2['海南']['南沙群岛']=new Array('南沙群岛');
GC2['海南']['西沙群岛']=new Array('西沙群岛');
GC2['海南']['中沙群岛的岛礁及其海域']=new Array('中沙群岛的岛礁及其海域');
GC2['海南']['海口']=new Array('海口市龙华区','海口市美兰区','海口市琼山区','海口市秀英区','海口市');
GC2['海南']['三亚']=new Array('三亚市','三亚市国营农场','三亚市海棠湾镇','三亚市吉阳镇','三亚市凤凰镇','三亚市河西区','三亚市河东区','三亚市崖城镇','三亚市天涯镇','三亚市育才镇');
GC2['海南']['五指山']=new Array('五指山市');
GC2['海南']['琼海']=new Array('琼海市');
GC2['海南']['儋州']=new Array('儋州市');
GC2['海南']['文昌']=new Array('文昌市');
GC2['海南']['万宁']=new Array('万宁市');
GC2['海南']['东方']=new Array('东方市');
GC2['海南']['澄迈县']=new Array('澄迈县');
GC2['海南']['定安县']=new Array('定安县');
GC2['海南']['屯昌县']=new Array('屯昌县');
GC2['海南']['临高县']=new Array('临高县');
GC2['海南']['白沙黎族自治县']=new Array('白沙黎族自治县');
GC2['海南']['昌江黎族自治县']=new Array('昌江黎族自治县');
GC2['海南']['乐东黎族自治县']=new Array('乐东黎族自治县');
GC2['海南']['陵水黎族自治县']=new Array('陵水黎族自治县');
GC2['海南']['琼中黎族苗族自治县']=new Array('琼中黎族苗族自治县');
GC2['湖北']=new Array();
GC2['湖北']['武汉']=new Array('武汉市江岸区','武汉市蔡甸区','武汉市东西湖区','武汉市汉南区','武汉市汉阳区','武汉市洪山区','武汉市黄陂区','武汉市江汉区','武汉市江夏区','武汉市硚口区','武汉市青山区','武汉市武昌区','武汉市新洲区','武汉市');
GC2['湖北']['黄石']=new Array('黄石市铁山区','黄石市黄石港区','黄石市西塞山区','黄石市下陆区','黄石市','大冶市','阳新县');
GC2['湖北']['襄阳']=new Array('南漳县','襄阳市襄城区','襄阳市樊城区','襄阳市襄州区','襄阳市','老河口市','枣阳市','宜城市','谷城县','保康县');
GC2['湖北']['十堰']=new Array('十堰市张湾区','十堰市茅箭区','十堰市','丹江口市','郧县','竹山县','房县','郧西县','竹溪县');
GC2['湖北']['荆州']=new Array('洪湖市','荆州市荆州区','荆州市沙市区','荆州市','石首市','松滋市','监利县','公安县','江陵县');
GC2['湖北']['宜昌']=new Array('宜昌市点军区','宜昌市伍家岗区','宜昌市西陵区','宜昌市猇亭区','宜昌市夷陵区','宜昌市','宜都市','当阳市','枝江市','秭归县','远安县','兴山县','五峰土家族自治县','长阳土家族自治县');
GC2['湖北']['荆门']=new Array('荆门市东宝区','荆门市掇刀区','荆门市','钟祥市','京山县','沙洋县');
GC2['湖北']['鄂州']=new Array('鄂州市鄂城区','鄂州市华容区','鄂州市梁子湖区','鄂州市');
GC2['湖北']['孝感']=new Array('孝感市孝南区','孝感市','应城市','安陆市','汉川市','云梦县','大悟县','孝昌县');
GC2['湖北']['黄冈']=new Array('黄冈市黄州区','黄冈市','麻城市','武穴市','红安县','罗田县','浠水县','蕲春县','黄梅县','英山县','团风县');
GC2['湖北']['咸宁']=new Array('咸宁市咸安区','咸宁市','赤壁市','嘉鱼县','通山县','崇阳县','通城县');
GC2['湖北']['随州']=new Array('随州市','随州市曾都区','广水市');
GC2['湖北']['仙桃']=new Array('仙桃市');
GC2['湖北']['天门']=new Array('天门市');
GC2['湖北']['潜江']=new Array('潜江市');
GC2['湖北']['神农架林区']=new Array('神农架林区','神农架林区');
GC2['湖北']['恩施土家族苗族自治州']=new Array('建始县','恩施市','利川市','来凤县','巴东县','鹤峰县','宣恩县','咸丰县');
GC2['黑龙江']=new Array();
GC2['黑龙江']['哈尔滨']=new Array('哈尔滨市南岗区','哈尔滨市道里区','哈尔滨市道外区','哈尔滨市平房区','哈尔滨市松北区','哈尔滨市香坊区','哈尔滨市','哈尔滨市阿城区','尚志市','双城市','五常市','哈尔滨市呼兰区','方正县','宾县','依兰县','巴彦县','通河县','木兰县','延寿县');
GC2['黑龙江']['齐齐哈尔']=new Array('齐齐哈尔市富拉尔基区','齐齐哈尔市昂昂溪区','齐齐哈尔市建华区','齐齐哈尔市龙沙区','齐齐哈尔市梅里斯达斡尔族区','齐齐哈尔市碾子山区','齐齐哈尔市铁锋区','齐齐哈尔市','讷河市','富裕县','拜泉县','甘南县','依安县','克山县','泰来县','克东县','龙江县');
GC2['黑龙江']['鹤岗']=new Array('鹤岗市东山区','鹤岗市工农区','鹤岗市南山区','鹤岗市向阳区','鹤岗市兴安区','鹤岗市兴山区','鹤岗市','萝北县','绥滨县');
GC2['黑龙江']['双鸭山']=new Array('宝清县','双鸭山市宝山区','双鸭山市尖山区','双鸭山市岭东区','双鸭山市四方台区','双鸭山市','集贤县','友谊县','饶河县');
GC2['黑龙江']['鸡西']=new Array('鸡西市城子河区','鸡西市滴道区','鸡西市恒山区','鸡西市鸡冠区','鸡西市梨树区','鸡西市麻山区','鸡西市','密山市','虎林市','鸡东县');
GC2['黑龙江']['大庆']=new Array('肇源县','大庆市大同区','大庆市红岗区','大庆市龙凤区','大庆市让胡路区','大庆市萨尔图区','大庆市','林甸县','肇州县','杜尔伯特蒙古族自治县');
GC2['黑龙江']['伊春']=new Array('伊春市红星区','伊春市西林区','伊春市翠峦区','伊春市带岭区','伊春市金山屯区','伊春市美溪区','伊春市南岔区','伊春市上甘岭区','伊春市汤旺河区','伊春市乌马河区','伊春市乌伊岭区','伊春市五营区','伊春市新青区','伊春市伊春区','伊春市友好区','伊春市','铁力市','嘉荫县');
GC2['黑龙江']['牡丹江']=new Array('东宁县','牡丹江市爱民区','牡丹江市东安区','牡丹江市西安区','牡丹江市阳明区','牡丹江市','绥芬河市','宁安市','海林市','穆棱市','林口县');
GC2['黑龙江']['佳木斯']=new Array('佳木斯市前进区','佳木斯市东风区','佳木斯市郊区','佳木斯市向阳区','佳木斯市','同江市','富锦市','桦川县','抚远县','桦南县','汤原县');
GC2['黑龙江']['七台河']=new Array('七台河市茄子河区','七台河市桃山区','七台河市新兴区','七台河市','勃利县');
GC2['黑龙江']['黑河']=new Array('黑河市爱辉区','黑河市','北安市','五大连池市','逊克县','嫩江县','孙吴县');
GC2['黑龙江']['绥化']=new Array('绥化市北林区','绥化市','安达市','肇东市','海伦市','绥棱县','兰西县','明水县','青冈县','庆安县','望奎县');
GC2['黑龙江']['大兴安岭']=new Array('大兴安岭地区加格达奇区','大兴安岭市','大兴安岭地区呼中区','大兴安岭地区松岭区','大兴安岭地区新林区','呼玛县','塔河县','漠河县');
GC2['河南']=new Array();
GC2['河南']['郑州']=new Array('郑州市二七区','郑州市管城回族区','郑州市惠济区','郑州市金水区','郑州市上街区','郑州市中原区','郑州市','巩义市','新郑市','新密市','登封市','荥阳市','中牟县','郑州市高新区','郑州市郑东新区','郑州市经济开发区');
GC2['河南']['鹤壁']=new Array('鹤壁市鹤山区','鹤壁市淇滨区','鹤壁市山城区','鹤壁市','浚县','淇县');
GC2['河南']['开封']=new Array('开封市鼓楼区','开封市金明区','开封市龙亭区','开封市顺河回族区','开封市禹王台区','开封市','开封县','尉氏县','兰考县','杞县','通许县');
GC2['河南']['洛阳']=new Array('洛阳市廛河回族区','洛阳市吉利区','洛阳市涧西区','洛阳市老城区','洛阳市洛龙区','洛阳市西工区','洛阳市','偃师市','孟津县','汝阳县','伊川县','洛宁县','嵩县','宜阳县','新安县','栾川县');
GC2['河南']['平顶山']=new Array('平顶山市石龙区','平顶山市卫东区','平顶山市新华区','平顶山市湛河区','平顶山市','汝州市','舞钢市','宝丰县','叶县','郏县','鲁山县');
GC2['河南']['焦作']=new Array('焦作市解放区','焦作市马村区','焦作市山阳区','焦作市中站区','焦作市','沁阳市','孟州市','修武县','温县','武陟县','博爱县','济源市');
GC2['河南']['新乡']=new Array('封丘县','新乡市凤泉区','新乡市红旗区','新乡市牧野区','新乡市卫滨区','新乡市','卫辉市','辉县市','新乡县','获嘉县','原阳县','长垣县','延津县');
GC2['河南']['安阳']=new Array('安阳市北关区','安阳市龙安区','安阳市文峰区','安阳市殷都区','安阳市','林州市','安阳县','滑县','内黄县','汤阴县');
GC2['河南']['濮阳']=new Array('南乐县','濮阳市华龙区','濮阳市','濮阳县','台前县','清丰县','范县');
GC2['河南']['许昌']=new Array('许昌市魏都区','许昌市','禹州市','长葛市','许昌县','鄢陵县','襄城县');
GC2['河南']['漯河']=new Array('漯河市源汇区','漯河市召陵区','漯河市','漯河市郾城区','临颍县','舞阳县');
GC2['河南']['三门峡']=new Array('三门峡市湖滨区','三门峡市','义马市','灵宝市','渑池县','卢氏县','陕县');
GC2['河南']['南阳']=new Array('南阳市宛城区','南阳市卧龙区','南阳市','邓州市','桐柏县','方城县','淅川县','镇平县','唐河县','南召县','内乡县','新野县','社旗县','西峡县');
GC2['河南']['商丘']=new Array('宁陵县','商丘市梁园区','商丘市睢阳区','商丘市','永城市','虞城县','民权县','夏邑县','柘城县','睢县');
GC2['河南']['信阳']=new Array('商城县','信阳市平桥区','信阳市浉河区','信阳市','潢川县','淮滨县','息县','新县','固始县','罗山县','光山县');
GC2['河南']['周口']=new Array('沈丘县','周口市川汇区','周口市','项城市','商水县','淮阳县','太康县','鹿邑县','西华县','扶沟县','郸城县');
GC2['河南']['驻马店']=new Array('驻马店市驿城区','驻马店市','确山县','新蔡县','上蔡县','西平县','泌阳县','平舆县','汝南县','遂平县','正阳县');
GC2['河北']=new Array();
GC2['河北']['石家庄']=new Array('行唐县','石家庄市桥西区','石家庄市长安区','石家庄市井陉矿区','石家庄市桥东区','石家庄市新华区','石家庄市裕华区','石家庄市','辛集市','藁城市','晋州市','新乐市','鹿泉市','平山县','井陉县','栾城县','正定县','灵寿县','高邑县','赵县','赞皇县','深泽县','无极县','元氏县');
GC2['河北']['唐山']=new Array('迁西县','唐山市丰南区','唐山市丰润区','唐山市古冶区','唐山市开平区','唐山市路北区','唐山市路南区','唐山市','遵化市','迁安市','滦南县','玉田县','唐海县','乐亭县','滦县');
GC2['河北']['秦皇岛']=new Array('秦皇岛市北戴河区','秦皇岛市海港区','秦皇岛市山海关区','秦皇岛市','昌黎县','卢龙县','抚宁县','青龙满族自治县');
GC2['河北']['邯郸']=new Array('邯郸市丛台区','邯郸市峰峰矿区','邯郸市复兴区','邯郸市邯山区','邯郸市','武安市','邯郸县','永年县','曲周县','馆陶县','魏县','成安县','大名县','涉县','鸡泽县','邱县','广平县','肥乡县','临漳县','磁县');
GC2['河北']['邢台']=new Array('隆尧县','邢台市桥东区','邢台市桥西区','邢台市','南宫市','沙河市','邢台县','柏乡县','任县','清河县','宁晋县','威县','临城县','广宗县','临西县','内丘县','平乡县','巨鹿县','新河县','南和县');
GC2['河北']['保定']=new Array('安国市','望都县','保定市北市区','保定市南市区','保定市新市区','保定市','涿州市','定州市','高碑店市','满城县','清苑县','涞水县','阜平县','徐水县','定兴县','唐县','高阳县','容城县','涞源县','安新县','易县','曲阳县','蠡县','顺平县','博野县','雄县');
GC2['河北']['张家口']=new Array('张家口市桥东区','张家口市桥西区','张家口市下花园区','张家口市宣化区','张家口市','宣化县','康保县','张北县','阳原县','赤城县','沽源县','怀安县','怀来县','崇礼县','尚义县','蔚县','涿鹿县','万全县');
GC2['河北']['承德']=new Array('承德市双滦区','承德市双桥区','承德市鹰手营子矿区','承德市','承德县','兴隆县','隆化县','平泉县','滦平县','丰宁满族自治县','围场满族蒙古族自治县','宽城满族自治县');
GC2['河北']['沧州']=new Array('吴桥县','沧州市新华区','沧州市运河区','沧州市','泊头市','任丘市','黄骅市','河间市','沧县','青县','献县','东光县','海兴县','盐山县','肃宁县','南皮县','孟村回族自治县');
GC2['河北']['廊坊']=new Array('廊坊市安次区','廊坊市广阳区','廊坊市','霸州市','三河市','固安县','永清县','香河县','大城县','文安县','大厂回族自治县');
GC2['河北']['衡水']=new Array('衡水市','衡水市桃城区','冀州市','深州市','饶阳县','枣强县','故城县','阜城县','安平县','武邑县','景县','武强县');
GC2['湖南']=new Array();
GC2['湖南']['长沙']=new Array('宁乡县','长沙市芙蓉区','长沙市开福区','长沙市天心区','长沙市雨花区','长沙市岳麓区','长沙市','浏阳市','长沙一区','望城县','长沙二区','长沙三区');
GC2['湖南']['株洲']=new Array('株洲市天元区','株洲市荷塘区','株洲市芦淞区','株洲市石峰区','株洲市','醴陵市','株洲县','炎陵县','茶陵县','攸县');
GC2['湖南']['湘潭']=new Array('湘潭市雨湖区','湘潭市岳塘区','湘潭市','湘乡市','韶山市','湘潭县');
GC2['湖南']['衡阳']=new Array('衡阳市南岳区','衡阳市石鼓区','衡阳市雁峰区','衡阳市蒸湘区','衡阳市珠晖区','衡阳市','耒阳市','常宁市','衡阳县','衡东县','衡山县','衡南县','祁东县');
GC2['湖南']['邵阳']=new Array('邵阳市北塔区','邵阳市大祥区','邵阳市双清区','邵阳市','武冈市','邵东县','洞口县','新邵县','绥宁县','新宁县','邵阳县','隆回县','城步苗族自治县');
GC2['湖南']['岳阳']=new Array('汨罗市','岳阳市君山区','岳阳市岳阳楼区','岳阳市云溪区','岳阳市','临湘市','岳阳县','湘阴县','平江县','华容县');
GC2['湖南']['常德']=new Array('安乡县','常德市鼎城区','常德市武陵区','常德市','津市市','澧县','临澧县','桃源县','汉寿县','石门县');
GC2['湖南']['张家界']=new Array('张家界市武陵源区','张家界市永定区','张家界市','慈利县','桑植县');
GC2['湖南']['益阳']=new Array('益阳市赫山区','益阳市资阳区','益阳市','沅江市','桃江县','南县','安化县');
GC2['湖南']['郴州']=new Array('郴州市','郴州市苏仙区','郴州市北湖区','资兴市','宜章县','汝城县','安仁县','嘉禾县','临武县','桂东县','永兴县','桂阳县');
GC2['湖南']['永州']=new Array('永州市冷水滩区','永州市零陵区','永州市','祁阳县','蓝山县','宁远县','新田县','东安县','江永县','道县','双牌县','江华瑶族自治县');
GC2['湖南']['怀化']=new Array('怀化市鹤城区','怀化市','洪江市','会同县','沅陵县','辰溪县','溆浦县','中方县','新晃侗族自治县','芷江侗族自治县','通道侗族自治县','靖州苗族侗族自治县','麻阳苗族自治县');
GC2['湖南']['娄底']=new Array('娄底市娄星区','娄底市','冷水江市','涟源市','新化县','双峰县');
GC2['湖南']['湘西土家族苗族自治州']=new Array('吉首市','古丈县','龙山县','永顺县','凤凰县','泸溪县','保靖县','花垣县');
GC2['江苏']=new Array();
GC2['江苏']['南京']=new Array('南京市白下区','南京市鼓楼区','南京市建邺区','南京市江宁区','南京市六合区','南京市浦口区','南京市栖霞区','南京市秦淮区','南京市下关区','南京市玄武区','南京市雨花台区','南京市','溧水县','高淳县');
GC2['江苏']['徐州']=new Array('新沂市','徐州市鼓楼区','徐州市贾汪区','徐州市泉山区','徐州市云龙区','徐州市九里区','徐州市','邳州市','铜山县','睢宁县','沛县','丰县');
GC2['江苏']['连云港']=new Array('连云港市连云区','连云港市新浦区','连云港市海州区','连云港市','东海县','灌云县','赣榆县','灌南县');
GC2['江苏']['淮安']=new Array('涟水县','淮安市淮安区','淮安市淮阴区','淮安市清河区','淮安市清浦区','淮安市','洪泽县','金湖县','盱眙县');
GC2['江苏']['宿迁']=new Array('宿迁市宿城区','宿迁市','宿迁市宿豫区','沭阳县','泗阳县','泗洪县');
GC2['江苏']['盐城']=new Array('东台市','盐城市亭湖区','盐城市','大丰市','盐城市盐都区','建湖县','响水县','阜宁县','射阳县','滨海县');
GC2['江苏']['扬州']=new Array('扬州市广陵区','扬州市邗江区','扬州市维扬区','扬州市','高邮市','江都市','仪征市','宝应县');
GC2['江苏']['泰州']=new Array('泰州市高港区','泰州市海陵区','泰州市','泰兴市','姜堰市','靖江市','兴化市');
GC2['江苏']['南通']=new Array('南通市崇川区','南通市港闸区','南通市','如皋市','通州市','海门市','启东市','海安县','如东县');
GC2['江苏']['镇江']=new Array('镇江市丹徒区','镇江市润州区','镇江市京口区','镇江市','丹阳市','扬中市','句容市');
GC2['江苏']['常州']=new Array('溧阳市','常州市钟楼区','常州市戚墅堰区','常州市天宁区','常州市武进区','常州市新北区','常州市','金坛市');
GC2['江苏']['无锡']=new Array('无锡市北塘区','无锡市滨湖区','无锡市崇安区','无锡市惠山区','无锡市南长区','无锡市锡山区','无锡市','宜兴市','新区');
GC2['江苏']['苏州']=new Array('苏州市沧浪区','苏州市虎丘区','苏州市金阊区','苏州市平江区','苏州市吴中区','苏州市相城区','苏州市','吴江一区','苏州市高新区','苏州市工业园区','吴江二区','吴江三区');
GC2['江苏']['昆山']=new Array('昆山市','玉山镇','周市镇','陆家镇','张浦镇','周庄镇','巴城镇','花桥镇','千灯镇');
GC2['江苏']['江阴']=new Array('江阴市','河墉镇','青阳镇','周庄镇');
GC2['江苏']['常熟']=new Array('常熟市','张家港市','太仓市');
GC2['吉林']=new Array();
GC2['吉林']['长春']=new Array('德惠市','长春市南关区','长春市朝阳区','长春市二道区','长春市宽城区','长春市绿园区','长春市双阳区','长春市','九台市','榆树市','农安县');
GC2['吉林']['吉林']=new Array('吉林市昌邑区','吉林市船营区','吉林市丰满区','吉林市龙潭区','吉林市','舒兰市','桦甸市','蛟河市','磐石市','永吉县');
GC2['吉林']['四平']=new Array('双辽市','四平市铁西区','四平市铁东区','四平市','公主岭市','梨树县','伊通满族自治县');
GC2['吉林']['辽源']=new Array('辽源市龙山区','辽源市西安区','辽源市','东辽县','东丰县');
GC2['吉林']['通化']=new Array('通化市东昌区','通化市二道江区','通化市','梅河口市','集安市','通化县','辉南县','柳河县');
GC2['吉林']['白山']=new Array('白山市八道江区','白山市','临江市','靖宇县','抚松县','白山市江源区','长白朝鲜族自治县');
GC2['吉林']['松原']=new Array('松原市宁江区','松原市','乾安县','长岭县','扶余县','前郭尔罗斯蒙古族自治县');
GC2['吉林']['白城']=new Array('白城市洮北区','白城市','大安市','洮南市','镇赉县','通榆县');
GC2['吉林']['延边朝鲜族自治州']=new Array('延吉市','图们市','敦化市','龙井市','珲春市','和龙市','安图县','汪清县');
GC2['江西']=new Array();
GC2['江西']['南昌']=new Array('南昌市东湖区','南昌市青山湖区','南昌市青云谱区','南昌市湾里区','南昌市西湖区','南昌市','新建县','南昌县','进贤县','安义县','红谷滩区');
GC2['江西']['景德镇']=new Array('景德镇市昌江区','景德镇市珠山区','景德镇市','乐平市','浮梁县');
GC2['江西']['萍乡']=new Array('莲花县','萍乡市安源区','萍乡市湘东区','萍乡市','上栗县','芦溪县');
GC2['江西']['新余']=new Array('新余市渝水区','新余市','分宜县');
GC2['江西']['九江']=new Array('九江市浔阳区','九江市庐山区','九江市','瑞昌市','九江县','星子县','武宁县','彭泽县','永修县','修水县','湖口县','德安县','都昌县');
GC2['江西']['鹰潭']=new Array('鹰潭市月湖区','鹰潭市','贵溪市','余江县');
GC2['江西']['赣州']=new Array('赣州市章贡区','赣州市','瑞金市','南康市','石城县','安远县','赣县','宁都县','寻乌县','兴国县','定南县','上犹县','于都县','龙南县','崇义县','信丰县','全南县','大余县','会昌县');
GC2['江西']['吉安']=new Array('井冈山市','吉安市吉州区','吉安市青原区','吉安市','吉安县','永丰县','永新县','新干县','泰和县','峡江县','遂川县','安福县','吉水县','万安县');
GC2['江西']['宜春']=new Array('丰城市','宜春市袁州区','宜春市','樟树市','高安市','铜鼓县','靖安县','宜丰县','奉新县','万载县','上高县');
GC2['江西']['抚州']=new Array('金溪县','抚州市临川区','抚州市','南丰县','乐安县','南城县','东乡县','资溪县','宜黄县','广昌县','黎川县','崇仁县');
GC2['江西']['上饶']=new Array('上饶市信州区','上饶市','德兴市','上饶县','广丰县','鄱阳县','婺源县','铅山县','余干县','横峰县','弋阳县','玉山县','万年县');
GC2['辽宁']=new Array();
GC2['辽宁']['本溪']=new Array('本溪市南芬区','本溪市平山区','本溪市溪湖区','本溪市明山区','本溪市','本溪满族自治县','桓仁满族自治县');
GC2['辽宁']['沈阳']=new Array('沈阳市大东区','沈阳市东陵区','沈阳市和平区','沈阳市皇姑区','沈阳市沈北新区','沈阳市沈河区','沈阳市苏家屯区','沈阳市于洪区','沈阳市铁西区','沈阳市','新民市','法库县','辽中县','康平县','沈阳市浑南新区');
GC2['辽宁']['大连']=new Array('大连市甘井子区','大连市金州区','大连市沙河口区','大连市西岗区','大连市中山区','大连市旅顺口区','大连市','瓦房店市','普兰店市','庄河市','长海县','开发区','大连市高新园区');
GC2['辽宁']['鞍山']=new Array('鞍山市立山区','鞍山市千山区','鞍山市铁东区','鞍山市铁西区','鞍山市','海城市','台安县','岫岩满族自治县');
GC2['辽宁']['抚顺']=new Array('抚顺市东洲区','抚顺市顺城区','抚顺市新抚区','抚顺市望花区','抚顺市','抚顺县','清原满族自治县','新宾满族自治县');
GC2['辽宁']['丹东']=new Array('丹东市元宝区','丹东市振安区','丹东市振兴区','丹东市','东港市','凤城市','宽甸满族自治县');
GC2['辽宁']['锦州']=new Array('北镇市','锦州市古塔区','锦州市凌河区','锦州市太和区','锦州市','凌海市','黑山县','义县');
GC2['辽宁']['葫芦岛']=new Array('葫芦岛市连山区','葫芦岛市南票区','葫芦岛市龙港区','葫芦岛市','兴城市','绥中县','建昌县');
GC2['辽宁']['营口']=new Array('营口市鲅鱼圈区','营口市老边区','营口市西市区','营口市站前区','营口市','大石桥市','盖州市');
GC2['辽宁']['盘锦']=new Array('盘锦市','盘锦市兴隆台区','盘锦市双台子区','盘山县','大洼县');
GC2['辽宁']['阜新']=new Array('阜新市海州区','阜新市清河门区','阜新市太平区','阜新市细河区','阜新市新邱区','阜新市','彰武县','阜新蒙古族自治县');
GC2['辽宁']['辽阳']=new Array('辽阳市白塔区','辽阳市弓长岭区','辽阳市宏伟区','辽阳市太子河区','辽阳市文圣区','辽阳市','灯塔市','辽阳县');
GC2['辽宁']['铁岭']=new Array('铁岭市清河区','铁岭市银州区','铁岭市','调兵山市','开原市','铁岭县','昌图县','西丰县');
GC2['辽宁']['朝阳']=new Array('朝阳市龙城区','朝阳市双塔区','朝阳市','凌源市','北票市','朝阳县','建平县','喀喇沁左翼蒙古族自治县');
GC2['内蒙古']=new Array();
GC2['内蒙古']['乌兰察布']=new Array('乌兰察布市','乌兰察布市集宁区','丰镇市','兴和县','卓资县','商都县','凉城县','化德县','察哈尔右翼前旗','察哈尔右翼中旗','察哈尔右翼后旗','四子王旗');
GC2['内蒙古']['锡林郭勒盟']=new Array('锡林浩特市','二连浩特市','多伦县','阿巴嘎旗','西乌珠穆沁旗','东乌珠穆沁旗','苏尼特左旗','苏尼特右旗','太仆寺旗','正镶白旗','正蓝旗','镶黄旗','锡林郭勒盟');
GC2['内蒙古']['巴彦淖尔']=new Array('乌拉特后旗','巴彦淖尔市','巴彦淖尔市临河区','五原县','磴口县','杭锦后旗','乌拉特中旗','乌拉特前旗');
GC2['内蒙古']['阿拉善盟']=new Array('阿拉善左旗','阿拉善右旗','额济纳旗');
GC2['内蒙古']['兴安盟']=new Array('乌兰浩特市','阿尔山市','突泉县','扎赉特旗','科尔沁右翼前旗','科尔沁右翼中旗');
GC2['内蒙古']['呼和浩特']=new Array('呼和浩特市赛罕区','呼和浩特市新城区','呼和浩特市玉泉区','呼和浩特市回民区','呼和浩特市','托克托县','清水河县','武川县','和林格尔县','土默特左旗');
GC2['内蒙古']['包头']=new Array('包头市东河区','包头市九原区','包头市昆都仑区','包头市青山区','包头市石拐区','包头市白云矿区','包头市','固阳县','土默特右旗','达尔罕茂明安联合旗','包头市滨河新区');
GC2['内蒙古']['乌海']=new Array('乌海市海勃湾区','乌海市海南区','乌海市乌达区','乌海市');
GC2['内蒙古']['赤峰']=new Array('巴林右旗','赤峰市红山区','赤峰市松山区','赤峰市元宝山区','赤峰市','宁城县','林西县','喀喇沁旗','巴林左旗','敖汉旗','阿鲁科尔沁旗','翁牛特旗','克什克腾旗');
GC2['内蒙古']['通辽']=new Array('通辽市科尔沁区','通辽市','霍林郭勒市','开鲁县','科尔沁左翼中旗','科尔沁左翼后旗','库伦旗','奈曼旗','扎鲁特旗');
GC2['内蒙古']['鄂尔多斯']=new Array('乌审旗','鄂尔多斯市东胜区','鄂尔多斯市','准格尔旗','伊金霍洛旗','鄂托克旗','鄂托克前旗','杭锦旗','达拉特旗');
GC2['内蒙古']['呼伦贝尔']=new Array('鄂温克族自治旗','呼伦贝尔市海拉尔区','呼伦贝尔市','满洲里市','牙克石市','扎兰屯市','根河市','额尔古纳市','陈巴尔虎旗','阿荣旗','新巴尔虎左旗','新巴尔虎右旗','鄂伦春自治旗','莫力达瓦达斡尔族自治旗');
GC2['宁夏']=new Array();
GC2['宁夏']['银川']=new Array('银川市金凤区','银川市西夏区','银川市兴庆区','银川市','永宁县','贺兰县','灵武市');
GC2['宁夏']['石嘴山']=new Array('石嘴山市大武口区','石嘴山市','平罗县','石嘴山市惠农区');
GC2['宁夏']['吴忠']=new Array('吴忠市利通区','吴忠市','青铜峡市','同心县','盐池县');
GC2['宁夏']['中卫']=new Array('中卫市','中卫市沙坡头区','中宁县','海原县');
GC2['宁夏']['固原']=new Array('固原市原州区','固原市','西吉县','隆德县','泾源县','彭阳县');
GC2['澳门']=new Array();
GC2['澳门']['澳门']=new Array('澳门');
GC2['青海']=new Array();
GC2['青海']['西宁']=new Array('西宁市城北区','西宁市城东区','西宁市城西区','西宁市城中区','西宁市','湟源县','湟中县','大通回族土族自治县');
GC2['青海']['海东']=new Array('平安县','乐都县','民和回族土族自治县','互助土族自治县','化隆回族自治县','循化撒拉族自治县');
GC2['青海']['海北藏族自治州']=new Array('海晏县','祁连县','刚察县','门源回族自治县');
GC2['青海']['黄南藏族自治州']=new Array('同仁县','泽库县','尖扎县','河南蒙古族自治县');
GC2['青海']['海南藏族自治州']=new Array('贵德县','共和县','同德县','兴海县','贵南县');
GC2['青海']['果洛藏族自治州']=new Array('玛沁县','班玛县','甘德县','达日县','久治县','玛多县');
GC2['青海']['玉树藏族自治州']=new Array('杂多县','玉树县','称多县','治多县','囊谦县','曲麻莱县');
GC2['青海']['海西蒙古族藏族自治州']=new Array('德令哈市','格尔木市','乌兰县','天峻县','都兰县');
GC2['四川']=new Array();
GC2['四川']['成都']=new Array('成都市','都江堰市','彭州市','邛崃市','崇州市','金堂县','郫县','新津县','双流县','蒲江县','大邑县','成都市成华区','成都市金牛区','成都市锦江区','成都市龙泉驿区','成都市青白江区','成都市青羊区','成都市温江区','成都市武侯区','成都市新都区','成都市高新区','天府新区');
GC2['四川']['自贡']=new Array('自贡市','荣县','富顺县','自贡市大安区','自贡市贡井区','自贡市沿滩区','自贡市自流井区');
GC2['四川']['攀枝花']=new Array('攀枝花市','米易县','盐边县','攀枝花市东区','攀枝花市仁和区','攀枝花市西区');
GC2['四川']['泸州']=new Array('泸州市','泸县','合江县','叙永县','古蔺县','泸州市江阳区','泸州市龙马潭区','泸州市纳溪区');
GC2['四川']['德阳']=new Array('德阳市','广汉市','什邡市','绵竹市','罗江县','中江县','德阳市旌阳区');
GC2['四川']['绵阳']=new Array('绵阳市','江油市','盐亭县','三台县','平武县','北川羌族自治县','安县','梓潼县','绵阳市涪城区','绵阳市游仙区');
GC2['四川']['广元']=new Array('广元市','青川县','旺苍县','剑阁县','苍溪县','广元市朝天区','广元市市中区','广元市元坝区');
GC2['四川']['遂宁']=new Array('遂宁市','射洪县','大英县','蓬溪县','遂宁市安居区','遂宁市船山区');
GC2['四川']['内江']=new Array('内江市','资中县','隆昌县','威远县','内江市东兴区','内江市市中区');
GC2['四川']['乐山']=new Array('乐山市','峨眉山市','夹江县','井研县','犍为县','马边彝族自治县','峨边彝族自治县','沐川县','乐山市金口河区','乐山市沙湾区','乐山市市中区','乐山市五通桥区');
GC2['四川']['南充']=new Array('南充市','阆中市','营山县','蓬安县','仪陇县','南部县','西充县','南充市高坪区','南充市嘉陵区','南充市顺庆区');
GC2['四川']['宜宾']=new Array('宜宾市','宜宾县','兴文县','南溪县','珙县','长宁县','高县','江安县','筠连县','屏山县','宜宾市翠屏区');
GC2['四川']['广安']=new Array('广安市','华蓥市','岳池县','邻水县','武胜县','广安市广安区');
GC2['四川']['达州']=new Array('达州市','万源市','达县','渠县','宣汉县','开江县','大竹县','达州市通川区');
GC2['四川']['巴中']=new Array('巴中市','南江县','平昌县','通江县','巴中市巴州区');
GC2['四川']['眉山']=new Array('眉山市','仁寿县','洪雅县','丹棱县','青神县','彭山县','眉山市东坡区');
GC2['四川']['资阳']=new Array('资阳市','简阳市','安岳县','乐至县','资阳市雁江区');
GC2['四川']['阿坝藏族羌族自治州']=new Array('马尔康县','九寨沟县','红原县','汶川县','理县','若尔盖县','小金县','黑水县','金川县','松潘县','壤塘县','茂县','阿坝县');
GC2['四川']['甘孜藏族自治州']=new Array('康定县','丹巴县','炉霍县','九龙县','甘孜县','雅江县','新龙县','道孚县','白玉县','理塘县','德格县','乡城县','石渠县','稻城县','色达县','巴塘县','泸定县','得荣县');
GC2['四川']['凉山彝族自治州']=new Array('西昌市','美姑县','昭觉县','金阳县','甘洛县','布拖县','雷波县','普格县','宁南县','喜德县','会东县','越西县','会理县','盐源县','德昌县','冕宁县','木里藏族自治县');
GC2['四川']['雅安']=new Array('雅安市','芦山县','石棉县','名山县','天全县','荥经县','宝兴县','汉源县','雅安市雨城区');
GC2['陕西']=new Array();
GC2['陕西']['西安']=new Array('西安市','高陵县','蓝田县','户县','周至县','西安市灞桥区','西安市长安区','西安市莲湖区','西安市临潼区','西安市未央区','西安市新城区','西安市阎良区','西安市雁塔区','西安市碑林区','西安南');
GC2['陕西']['铜川']=new Array('铜川市','宜君县','铜川市王益区','铜川市耀州区','铜川市印台区');
GC2['陕西']['宝鸡']=new Array('宝鸡市','岐山县','凤翔县','太白县','麟游县','扶风县','千阳县','眉县','凤县','陇县','宝鸡市陈仓区','宝鸡市渭滨区','宝鸡市金台区');
GC2['陕西']['咸阳']=new Array('咸阳市','兴平市','礼泉县','泾阳县','三原县','彬县','旬邑县','长武县','乾县','武功县','淳化县','永寿县','咸阳市秦都区','咸阳市渭城区','咸阳市杨凌区');
GC2['陕西']['渭南']=new Array('渭南市','韩城市','华阴市','潼关县','白水县','澄城县','华县','合阳县','富平县','大荔县','蒲城县','渭南市临渭区');
GC2['陕西']['延安']=new Array('延安市','安塞县','洛川县','子长县','黄陵县','延川县','富县','延长县','甘泉县','宜川县','志丹县','黄龙县','吴起县','延安市宝塔区');
GC2['陕西']['汉中']=new Array('汉中市','留坝县','镇巴县','城固县','南郑县','洋县','宁强县','佛坪县','勉县','西乡县','略阳县','汉中市汉台区');
GC2['陕西']['榆林']=new Array('榆林市','清涧县','绥德县','神木县','佳县','子洲县','靖边县','横山县','米脂县','吴堡县','定边县','府谷县','榆林市榆阳区');
GC2['陕西']['安康']=new Array('安康市','紫阳县','岚皋县','旬阳县','平利县','石泉县','宁陕县','白河县','汉阴县','镇坪县','安康市汉滨区');
GC2['陕西']['商洛']=new Array('商洛市','镇安县','山阳县','洛南县','商南县','丹凤县','柞水县','商洛市商州区');
GC2['上海']=new Array();
GC2['上海']['上海']=new Array('上海市宝山区','上海市长宁区','上海市奉贤区','上海市虹口区','上海市黄浦区','上海市嘉定区','上海市金山区','上海市静安区','上海市卢湾区','上海市闵行区','上海市南汇区','上海市浦东新区','上海市普陀区','上海市青浦区','上海市松江区','上海市徐汇区','上海市杨浦区','上海市闸北区','上海市','崇明县','上海市浦东新区周边','上海市南汇区周边');
GC2['山东']=new Array();
GC2['山东']['聊城']=new Array('聊城市','临清市','高唐县','阳谷县','茌平县','莘县','东阿县','冠县','聊城市东昌府区');
GC2['山东']['滨州']=new Array('滨州市','邹平县','沾化县','惠民县','博兴县','阳信县','无棣县','滨州市滨城区');
GC2['山东']['菏泽']=new Array('菏泽市','鄄城县','单县','郓城县','曹县','定陶县','巨野县','东明县','成武县','菏泽市牡丹区');
GC2['山东']['潍坊']=new Array('潍坊市坊子区','潍坊市寒亭区','潍坊市潍城区','潍坊市奎文区','潍坊市','青州市','诸城市','寿光市','安丘市','高密市','昌邑市','昌乐县','临朐县');
GC2['山东']['日照']=new Array('日照市东港区','日照市岚山区','日照市','五莲县','莒县');
GC2['山东']['济南']=new Array('济南市','济南市长清区','济南市槐荫区','济南市历城区','济南市市中区','济南市天桥区','济南市历下区','章丘市','平阴县','济阳县','商河县');
GC2['山东']['青岛']=new Array('青岛市城阳区','青岛市黄岛区','青岛市崂山区','青岛市李沧区','青岛市市北区','青岛市四方区','青岛市市南区','青岛市','胶南市','胶州市','平度市','莱西市','即墨市');
GC2['山东']['淄博']=new Array('淄博市','淄博市博山区','淄博市临淄区','淄博市张店区','淄博市周村区','淄博市淄川区','桓台县','高青县','沂源县');
GC2['山东']['枣庄']=new Array('枣庄市山亭区','枣庄市市中区','枣庄市薛城区','枣庄市峄城区','枣庄市台儿庄区','枣庄市','滕州市');
GC2['山东']['东营']=new Array('东营市东营区','东营市河口区','东营市','垦利县','广饶县','利津县');
GC2['山东']['烟台']=new Array('烟台市福山区','烟台市莱山区','烟台市牟平区','烟台市芝罘区','烟台市','龙口市','莱阳市','莱州市','招远市','蓬莱市','栖霞市','海阳市','长岛县');
GC2['山东']['威海']=new Array('威海市环翠区','威海市','乳山市','文登市','荣成市');
GC2['山东']['济宁']=new Array('济宁市任城区','济宁市市中区','济宁市','曲阜市','兖州市','邹城市','鱼台县','金乡县','嘉祥县','微山县','汶上县','泗水县','梁山县');
GC2['山东']['泰安']=new Array('泰安市岱岳区','泰安市泰山区','泰安市','新泰市','肥城市','宁阳县','东平县');
GC2['山东']['莱芜']=new Array('莱芜市钢城区','莱芜市莱城区','莱芜市');
GC2['山东']['德州']=new Array('齐河县','德州市德城区','德州市','乐陵市','禹城市','陵县','宁津县','武城县','庆云县','平原县','夏津县','临邑县');
GC2['山东']['临沂']=new Array('沂水县','苍山县','平邑县','莒南县','蒙阴县','临沭县','费县','临沂市兰山区','临沂市罗庄区','临沂市河东区','临沂市','沂南县','郯城县');
GC2['山西']=new Array();
GC2['山西']['太原']=new Array('娄烦县','太原市尖草坪区','太原市晋源区','太原市万柏林区','太原市小店区','太原市杏花岭区','太原市迎泽区','太原市','古交市','阳曲县','清徐县');
GC2['山西']['大同']=new Array('大同市城区','大同市矿区','大同市南郊区','大同市新荣区','大同市','大同县','天镇县','灵丘县','阳高县','左云县','广灵县','浑源县');
GC2['山西']['阳泉']=new Array('阳泉市城区','阳泉市郊区','阳泉市矿区','阳泉市','平定县','盂县');
GC2['山西']['长治']=new Array('长治市城区','长治市郊区','长治市','潞城市','长治县','长子县','平顺县','襄垣县','沁源县','屯留县','黎城县','武乡县','沁县','壶关县');
GC2['山西']['晋城']=new Array('晋城市城区','晋城市','高平市','泽州县','陵川县','阳城县','沁水县');
GC2['山西']['朔州']=new Array('朔州市平鲁区','朔州市朔城区','朔州市','山阴县','右玉县','应县','怀仁县');
GC2['山西']['晋中']=new Array('和顺县','晋中市榆次区','晋中市','介休市','昔阳县','灵石县','祁县','左权县','寿阳县','太谷县','平遥县','榆社县');
GC2['山西']['忻州']=new Array('静乐县','忻州市忻府区','忻州市','原平市','代县','神池县','五寨县','五台县','偏关县','宁武县','繁峙县','河曲县','保德县','定襄县','岢岚县');
GC2['山西']['临汾']=new Array('大宁县','临汾市尧都区','临汾市','侯马市','霍州市','汾西县','吉县','安泽县','浮山县','古县','隰县','襄汾县','翼城县','永和县','乡宁县','曲沃县','洪洞县','蒲县');
GC2['山西']['运城']=new Array('运城市盐湖区','运城市','河津市','永济市','闻喜县','新绛县','平陆县','垣曲县','绛县','稷山县','芮城县','夏县','万荣县','临猗县');
GC2['山西']['吕梁']=new Array('吕梁市','吕梁市离石区','孝义市','汾阳市','文水县','中阳县','兴县','临县','方山县','柳林县','岚县','交口县','交城县','石楼县');
GC2['台湾']=new Array();
GC2['台湾']['台湾']=new Array('台湾');
GC2['天津']=new Array();
GC2['天津']['天津']=new Array('天津市','静海县','宁河县','蓟县','天津市宝坻区','天津市北辰区','天津市大港区','天津市东丽区','天津市汉沽区','天津市和平区','天津市河北区','天津市河东区','天津市河西区','天津市红桥区','天津市津南区','天津市南开区','天津市塘沽区','天津市武清区','天津市西青区');
GC2['西藏']=new Array();
GC2['西藏']['拉萨']=new Array('拉萨市','林周县','达孜县','尼木县','当雄县','曲水县','墨竹工卡县','堆龙德庆县','拉萨市城关区');
GC2['西藏']['那曲']=new Array('那曲县','嘉黎县','申扎县','巴青县','聂荣县','尼玛县','比如县','索县','班戈县','安多县');
GC2['西藏']['昌都']=new Array('昌都县','芒康县','贡觉县','八宿县','左贡县','边坝县','洛隆县','江达县','类乌齐县','丁青县','察雅县');
GC2['西藏']['山南']=new Array('乃东县','琼结县','措美县','加查县','贡嘎县','洛扎县','曲松县','桑日县','扎囊县','错那县','浪卡子县','隆子县');
GC2['西藏']['日喀则']=new Array('日喀则市','定结县','萨迦县','江孜县','拉孜县','定日县','康马县','聂拉木县','吉隆县','谢通门县','昂仁县','岗巴县','仲巴县','萨嘎县','仁布县','白朗县','南木林县','亚东县');
GC2['西藏']['阿里']=new Array('噶尔县','措勤县','普兰县','革吉县','日土县','札达县','改则县');
GC2['西藏']['林芝']=new Array('林芝县','墨脱县','朗县','米林县','察隅县','波密县','工布江达县');
GC2['香港']=new Array();
GC2['香港']['香港']=new Array('香港');
GC2['新疆']=new Array();
GC2['新疆']['乌鲁木齐']=new Array('乌鲁木齐市','乌鲁木齐县','乌鲁木齐市达坂城区','乌鲁木齐市米东区','乌鲁木齐市沙依巴克区','乌鲁木齐市水磨沟区','乌鲁木齐市天山区','乌鲁木齐市头屯河区','乌鲁木齐市新市区');
GC2['新疆']['克拉玛依']=new Array('克拉玛依市','克拉玛依市白碱滩区','克拉玛依市独山子区','克拉玛依市克拉玛依区','克拉玛依市乌尔禾区');
GC2['新疆']['石河子']=new Array('石河子市');
GC2['新疆']['阿拉尔']=new Array('阿拉尔市');
GC2['新疆']['图木舒克']=new Array('图木舒克市');
GC2['新疆']['五家渠']=new Array('五家渠市');
GC2['新疆']['吐鲁番']=new Array('吐鲁番市','托克逊县','鄯善县');
GC2['新疆']['哈密']=new Array('哈密市','伊吾县','巴里坤哈萨克自治县');
GC2['新疆']['和田']=new Array('和田市','和田县','洛浦县','民丰县','皮山县','策勒县','墨玉县','于田县');
GC2['新疆']['阿克苏']=new Array('阿克苏市','温宿县','沙雅县','拜城县','阿瓦提县','库车县','柯坪县','新和县','乌什县');
GC2['新疆']['克孜勒苏柯尔克孜自治州']=new Array('阿图什市','阿合奇县','乌恰县','阿克陶县');
GC2['新疆']['巴音郭楞蒙古自治州']=new Array('库尔勒市','和静县','尉犁县','和硕县','且末县','博湖县','轮台县','若羌县','焉耆回族自治县');
GC2['新疆']['昌吉回族自治州']=new Array('昌吉市','阜康市','米泉市','奇台县','玛纳斯县','吉木萨尔县','呼图壁县','木垒哈萨克自治县');
GC2['新疆']['博尔塔拉蒙古自治州']=new Array('博乐市','精河县','温泉县');
GC2['新疆']['伊犁哈萨克自治州']=new Array('奎屯市','伊宁县','特克斯县','尼勒克县','昭苏县','新源县','霍城县','巩留县','察布查尔锡伯自治县','伊宁市');
GC2['新疆']['喀什']=new Array('喀什市','巴楚县','泽普县','伽师县','叶城县','岳普湖县','疏勒县','麦盖提县','英吉沙县','莎车县','疏附县','塔什库尔干塔吉克自治县');
GC2['新疆']['阿勒泰地区']=new Array('阿勒泰市','青河县','吉木乃县','富蕴县','布尔津县','福海县','哈巴河县');
GC2['新疆']['塔城地区']=new Array('塔城市','乌苏市','额敏县','沙湾县','托里县','和布克赛尔蒙古自治县','裕民县');
GC2['云南']=new Array();
GC2['云南']['昆明']=new Array('昆明市','安宁市','富民县','嵩明县','呈贡县','晋宁县','宜良县','禄劝彝族苗族自治县','石林彝族自治县','寻甸回族自治县','昆明市东川区','昆明市官渡区','昆明市盘龙区','昆明市五华区','昆明市西山区');
GC2['云南']['曲靖']=new Array('曲靖市','宣威市','陆良县','会泽县','富源县','罗平县','马龙县','师宗县','沾益县','曲靖市麒麟区');
GC2['云南']['玉溪']=new Array('玉溪市','华宁县','澄江县','易门县','通海县','江川县','元江哈尼族彝族傣族自治县','新平彝族傣族自治县','峨山彝族自治县','玉溪市红塔区');
GC2['云南']['保山']=new Array('保山市','施甸县','龙陵县','腾冲县','昌宁县','保山市隆阳区');
GC2['云南']['昭通']=new Array('昭通市','永善县','绥江县','镇雄县','大关县','盐津县','巧家县','彝良县','水富县','鲁甸县','威信县','昭通市昭阳区');
GC2['云南']['普洱']=new Array('普洱市','宁洱哈尼族彝族自治县','景东彝族自治县','镇沅彝族哈尼族拉祜族自治县','景谷傣族彝族自治县','墨江哈尼族自治县','澜沧拉祜族自治县','西盟佤族自治县','江城哈尼族彝族自治县','孟连傣族拉祜族佤族自治县','普洱市思茅区');
GC2['云南']['临沧']=new Array('临沧市临翔区','镇康县','凤庆县','云县','永德县','双江拉祜族佤族布朗族傣族自治县','沧源佤族自治县','耿马傣族佤族自治县','临沧市');
GC2['云南']['丽江']=new Array('丽江市','玉龙纳西族自治县','华坪县','永胜县','宁蒗彝族自治县','丽江市古城区');
GC2['云南']['文山壮族苗族自治州']=new Array('文山县','麻栗坡县','砚山县','广南县','马关县','富宁县','西畴县','丘北县');
GC2['云南']['红河哈尼族彝族自治州']=new Array('个旧市','开远市','弥勒县','红河县','绿春县','蒙自县','泸西县','建水县','元阳县','石屏县','河口瑶族自治县','屏边苗族自治县','金平苗族瑶族傣族自治县');
GC2['云南']['西双版纳傣族自治州']=new Array('景洪市','勐海县','勐腊县','西双版纳市');
GC2['云南']['楚雄彝族自治州']=new Array('楚雄市','元谋县','南华县','牟定县','武定县','大姚县','双柏县','禄丰县','永仁县','姚安县');
GC2['云南']['大理白族自治州']=new Array('大理市','剑川县','弥渡县','云龙县','洱源县','鹤庆县','祥云县','宾川县','永平县','漾濞彝族自治县','巍山彝族回族自治县','南涧彝族自治县');
GC2['云南']['德宏傣族景颇族自治州']=new Array('潞西市','瑞丽市','盈江县','梁河县','陇川县');
GC2['云南']['怒江傈傈族自治州']=new Array('泸水县','福贡县','兰坪白族普米族自治县','贡山独龙族怒族自治县');
GC2['云南']['迪庆藏族自治州']=new Array('香格里拉县','德钦县','维西傈僳族自治县');
GC2['浙江']=new Array();
GC2['浙江']['宁波']=new Array('宁波市','余姚市','慈溪市','奉化市','宁海县','象山县','宁波市北仑区','宁波市海曙区','宁波市江北区','宁波市江东区','宁波市鄞州区','宁波市镇海区');
GC2['浙江']['温州']=new Array('温州市','瑞安市','乐清市','永嘉县','洞头县','平阳县','苍南县','文成县','泰顺县','温州市龙湾区','温州市鹿城区','温州市瓯海区');
GC2['浙江']['嘉兴']=new Array('嘉兴市','海宁市','平湖市','桐乡市','嘉善县','海盐县','嘉兴市南湖区','嘉兴市秀洲区');
GC2['浙江']['湖州']=new Array('湖州市','长兴县','德清县','安吉县','湖州市南浔区','湖州市吴兴区');
GC2['浙江']['绍兴']=new Array('绍兴市','诸暨市','嵊州市','绍兴县','新昌县','上虞市','绍兴市越城区');
GC2['浙江']['金华']=new Array('金华市','兰溪市','东阳市','永康市','武义县','浦江县','磐安县','金华市金东区','金华市婺城区');
GC2['浙江']['舟山']=new Array('舟山市','岱山县','嵊泗县','舟山市定海区','舟山市普陀区');
GC2['浙江']['台州']=new Array('台州市','温岭市','玉环县','天台县','仙居县','三门县','临海市','台州市黄岩区','台州市椒江区','台州市路桥区');
GC2['浙江']['丽水']=new Array('丽水市','龙泉市','缙云县','青田县','云和县','遂昌县','松阳县','庆元县','景宁畲族自治县','丽水市莲都区');
GC2['浙江']['杭州']=new Array('杭州市','建德市','富阳市','临安市','桐庐县','淳安县','杭州市滨江区','杭州市拱墅区','杭州市江干区','杭州市上城区','杭州市西湖区','杭州市下城区','杭州市上萧山区','杭州市余杭区','杭州市新余杭区','杭州市下萧山区');
GC2['浙江']['衢州']=new Array('衢州市','江山市','龙游县','常山县','开化县','衢州市柯城区','衢州市衢江区');
GC2['浙江']['义乌']=new Array('义乌市');

/* module object */
function GlobalProvincesModule ()
{
	this.debug = false;
	this.def_province = ["--", ""];
	this.def_city1 = ["--", ""];
	this.def_city2 = ["--", ""];

	this.initProvince = function (obj1)
	{
		try{
			var i;
			for(i = obj1.options.length -1; i >= 0 ; i--)
			{
				this.removeOptionItem(obj1, i);
			}

			if(this.def_province)
				obj1.options.add(new Option(this.def_province[0], this.def_province[1]));

			if(!GP) return;

			for(i=0; i < GP.length; i++)
			{
				obj1.options.add(new Option(GP_EN[i], GP[i]));
			}
		}catch(e){if(this.debug) alert("执行方法\"initProvince\"时，遇到" + e.message);}
	}

	this.initCity1 = function (obj1, key)
	{
		try{
			var i;
			for(i = obj1.options.length -1; i >= 0 ; i--)
			{
				this.removeOptionItem(obj1, i);
			}

			if(this.def_city1)
				obj1.options.add(new Option(this.def_city1[0], this.def_city1[1]));

			if(!GC1[key]) return;

			for(i=0; i < GC1[key].length; i++)
			{
				obj1.options.add(new Option(GC1[key][i], GC1[key][i]));
			}
		}catch(e){if(this.debug) alert("执行方法\"initCity1\"时，遇到" + e.message);}
	}

	this.initCity2 = function (obj1, key, key2)
	{
		
		try{
			var i;
			for(i = obj1.options.length -1; i >= 0 ; i--)
			{
				this.removeOptionItem(obj1, i);
			}
          
			if( this.def_city2 && key==0 || this.def_city2 && GC2[key][key2].length > 1)    //只有一项的情况下不要出现提示 by robin2008-9-7
			{
				obj1.options.add(new Option(this.def_city2[0], this.def_city2[1]));
			}

			if(!GC2[key]) return;
			if(!GC2[key][key2])
			{
				obj1.options.add(new Option(key2, key2));
				obj1.options[obj1.options.length - 1].selected = true;
			}else{
				for(i=0; i < GC2[key][key2].length; i++)
				{
					obj1.options.add(new Option(GC2[key][key2][i], GC2[key][key2][i]));
				}

				if(GC2[key][key2].length == 1)
					obj1.options[GC2[key][key2].length - 1].selected = true;
			}

		}catch(e){if(this.debug) alert("执行方法\"initCity2\"时，遇到" + e.message);}
	}

	this.selectProvincesItem = function (obj1, value)
	{
		try{
			var ret = false;
			for(var i = 0; i < obj1.options.length; i++)
			{
				if(obj1.options[i].text == value)
				{
					ret = obj1.options[i].selected = true;
					break;
				}
			}
			return ret;
		}catch(e){if(this.debug) alert("执行方法\"selectProvincesItem\"时，遇到" + e.message);}
	}

	this.selectCity1Item = function (obj1, value)
	{
		try{
			var ret = false;
			for(var i = 0; i < obj1.options.length; i++)
			{
				if(obj1.options[i].text == value)
				{
					ret = obj1.options[i].selected = true;
					break;
				}
			}
			return ret;
		}catch(e){if(this.debug) alert("执行方法\"selectCity1Item\"时，遇到" + e.message);}
	}

	this.selectCity2Item = function (obj1, value)
	{
		try{
			var ret = false;
			for(var i = 0; i < obj1.options.length; i++)
			{
				if(obj1.options[i].text == value)
				{
					ret = obj1.options[i].selected = true;
					break;
				}
			}
			return ret;
		}catch(e){if(this.debug) alert("执行方法\"selectCity2Item\"时，遇到" + e.message);}
	}

	this.getSelValue = function (obj1)
	{
		if(obj1 && obj1.options && obj1.options.length > 0)
			return obj1.options[obj1.selectedIndex].value;
		else
			return null;
	}

	this.getProvinceNameById = function (id)
	{
		try{
			var ret = "";
			for(var i = 0; i< GP.length; i++)
			{
				if(GP[i][1] == id)
				{
					ret = GP[i];
					break;
				}
			}

			return ret;
		}catch(e){if(this.debug) alert("执行方法\"getProvinceNameById\"时，遇到" + e.message);}
	}

	this.getProvinceIdByName = function (name)
	{
		try{
			var ret = -1;
			for(var i = 0; i< GP.length; i++)
			{
				if(GP[i] == name)
				{
					ret = GP[i][1];
					break;
				}
			}

			return ret;
		}catch(e){if(this.debug) alert("执行方法\"getProvinceIdByName\"时，遇到" + e.message);}
	}

	this.removeOptionItem = function(obj, index)
	{
		if(typeof obj.options.remove == "undefined")
		{
			obj.remove(index);
		}else{
			obj.options.remove(index);
		}
	}
}


function changeTown(sShen,sCity,sTown) {
	
	gpm.initCity2($(sTown), gpm.getSelValue($(sShen)), gpm.getSelValue($(sCity)));
}

function changeProvince(sShen,sCity,sTown) {
	if($(sShen).value=="天津" || $(sShen).value=="北京"|| $(sShen).value=="重庆" || $(sShen).value=="上海")
	{
		//$(sTown).style.display='none';		
	}
	else
	{
		$(sTown).style.display='';	
	}

	gpm.initCity1($(sCity), gpm.getSelValue($(sShen)));
	gpm.initCity2($(sTown), '', '');
}
function showSaleBox(sShen,sCity,sTown,saleBox)
{
	
	
	if(!saleBox)
		saleBox='sale_box';
	if(!$(sTown).value)
	{	
		$('sname').blur();
		alert('请先选择城市');
		return false
	}
	//drag($(saleBox),false);
	
	$('shen_city_town').innerHTML=$(sShen).value+'-'+$(sCity).value+'-'+$(sTown).value;
	var oAs=$('saleorderbox').getElementsByTagName('A');
	for(var i=0,j=oAs.length;i<j;i++)
	{
		oAs[i].onclick=thisAction_letter;
	}
	
	xajax_x_create_salelist('salelistbox','pagelist',$(sShen).value,$(sCity).value,$(sTown).value,$('saleorder').value);
	$(saleBox).style.display='block';

}

function hiddenSaleBox(evt)
{
	evt=evt||window.event;
	evt.target=evt.target||evt.srcElement;
	
	if(evt.target!=$('sale_box')&&$('sale_box').style.display=='block'&&evt.target.id!='sname')
		$('sale_box').style.display='none';
}
function thisAction_letter()
{
	var oAs=this.parentNode.getElementsByTagName('A');
	//var oAs=$('saleorderbox').getElementsByTagName('A');
	$('saleorder').value=this.firstChild.data;
	for(var i=0,j=oAs.length;i<j;i++)
	{
		oAs[i].className='';
		if(this==oAs[i])
			this.className='letter_whole';
	}	
	xajax_x_create_salelist('salelistbox','pagelist',$('User_Shen').value,$('User_City').value,$('User_Town').value,this.firstChild.data);
	return false;
}
function alterPage(page)
{
	xajax_x_create_salelist('salelistbox','pagelist',$('User_Shen').value,$('User_City').value,$('User_Town').value,$('saleorder').value,page);
	return;
}
function selectedSale(sid,sname)
{
	$('saleid').value=sid;
	$('sname').value =sname;
	$('sys_sale').value =$('sname').value+"."+$('User_Town').value;
	$('sale_box').style.display='none';
	if(typeof(findbyhouse)=='function')
		findbyhouse();
}